Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.InvalidFluidProperty
Some network components may have a flow value of 0 (zero), due to invalid value settings for fluid Dynamic Viscosity or Density. \nVerify that you have selected the correct fluid type and that the fluid Dynamic Viscosity and Density values are set correctly in the Mechanical Settings dialog.